### [Series & DataFrame 연산]

In [1]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np

In [2]:
# [2] 데이터 준비
file_name = 'data1.csv'

In [15]:
# [3] 데이터 프레임으로 변환
df1 = pd.read_csv(file_name, header=None)
df1

    0   1   2
0  10  20  30
1  90  80  70
2  66  55  44
3  90  90  90
4   5   5   5

In [16]:
# [4] 연산 실습
# 0번 컬럼과 2번 컬럼을 덧셈 연산 수행
result = df1[0] + df1[2]
result

0     40
1    160
2    110
3    180
4     10
dtype: int64

In [17]:
# [5] 0번 컬럼 ~ 2번 컬럼까지의 덧셈 수행
result = df1[0] + df1[1] + df1[2]
result

0     60
1    240
2    165
3    270
4     15
dtype: int64

In [18]:
# 3개 컬럼 덧셈 결과를 새로운 컬럼으로 추가
df1['Total'] = result
df1

    0   1   2  Total
0  10  20  30     60
1  90  80  70    240
2  66  55  44    165
3  90  90  90    270
4   5   5   5     15

In [21]:
result2 = df1.loc[0] + df1.loc[1] + df1.loc[2] + df1.loc[3] + df1.loc[4]
result2

0        261
1        250
2        239
Total    750
dtype: int64

In [23]:
df1.loc[5] = result2
df1

     0    1    2  Total
0   10   20   30     60
1   90   80   70    240
2   66   55   44    165
3   90   90   90    270
4    5    5    5     15
5  261  250  239    750

In [27]:
# [5] 연산 수행 메서드 : 합계 sum(), 최대값 max(), 최소값 min()
sr0 = df1[0]
print(sr0)
print('합계 :', sr0.sum())
print('최대값 :', sr0.max())
print('최소값 :', sr0.min())
print('최대값 :', sr0.std())

0     10
1     90
2     66
3     90
4      5
5    261
Name: 0, dtype: int64
합계 : 522
최대값 : 261
최소값 : 5
최대값 : 93.15363653663769

In [28]:
# DataFrame으로 연산 수행 메서드
df1

     0    1    2  Total
0   10   20   30     60
1   90   80   70    240
2   66   55   44    165
3   90   90   90    270
4    5    5    5     15
5  261  250  239    750

In [30]:
# DataFrame 합계 계산
# 각 행 데이터를 모아서 합계 수행. 그래서 컬럼 마다 행들을 모아서 합계 수행
print('합계 :', df1.sum())

# 각 컬럼 데이터를 모아서 합계 수행. 그래서 행 마다 컬럼들을 모아서 합계 수행
print('합계 :', df1.sum(axis = 1))

합계 : 0         522
1         500
2         478
Total    1500
dtype: int64
합계 : 0     120
1     480
2     330
3     540
4      30
5    1500
dtype: int64

In [32]:
# DataFrame 최대값 계산
print('최대값', df1.max())
print('최대값', df1.max(axis = 1))

최대값 0        261
1        250
2        239
Total    750
dtype: int64
최대값 0     60
1    240
2    165
3    270
4     15
5    750
dtype: int64

In [33]:
# DataFrame 최소값 계산
print('최소값', df1.min())
print('최소값', df1.min(axis = 1))

최소값 0         5
1         5
2         5
Total    15
dtype: int64
최소값 0     10
1     70
2     44
3     90
4      5
5    239
dtype: int64

### 연산과 데이터 추출
- 연산 결과와 데이터 추출 함께 진행

In [55]:
# Total이 100 이상인 데이터만 추출
# 비교 연산 결과 ==> True/False : Boolean Index
bool_index = df1['Total'] > 100
bool_index

0    False
1     True
2     True
3     True
4    False
5     True
Name: Total, dtype: bool

In [47]:
# Boolean Index 즉, 인덱스로 특정 데이터 추출에 사용 가능
# df1[컬럼인덱스], df1.iloc[행인덱스], df1.loc[행인덱스]
df1[bool_index]

     0    1    2  Total
1   90   80   70    240
2   66   55   44    165
3   90   90   90    270
5  261  250  239    750